[Killed] BlockStatement
syuji-higa/demo-react-counter/src/App.tsx:13:46
 }
 
 // カウントに関するカスタムフック
-const useCount: UseCount = (initialValue) => {
-  // カウントのステート
-  const [count, setCount] = useState(initialValue)
-  
-  // インクリメントの関数
-  const increment = () => {
-    setCount(count + 1)
-  }
-  
-  // デクリメントの関数
-  const decrement = () => {
-    setCount(count - 1)
-  }
-  
-  return { count, increment, decrement }
-}
+const useCount: UseCount = (initialValue) => {}
 
 // 全体のコンポーネント
killedBy: カウンター A は はじめに カウント A の Aria Label に "Counter A count" を設定する
statusReason: TypeError: Cannot destructure property 'count' of 'useCount(...)' as it is undefined.

[Killed] BlockStatement
syuji-higa/demo-react-counter/src/App.tsx:18:27
   const [count, setCount] = useState(initialValue)
   
   // インクリメントの関数
-  const increment = () => {
-    setCount(count + 1)
-  }
+  const increment = () => {}
   
   // デクリメントの関数
killedBy: カウンター A は + ボタンを 1 回クリックすると カウント A に 1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "0"

[Killed] ArithmeticOperator
syuji-higa/demo-react-counter/src/App.tsx:19:14
   
   // インクリメントの関数
   const increment = () => {
-    setCount(count + 1)
+    setCount(count - 1)
   }
   
killedBy: カウンター A は + ボタンを 1 回クリックすると カウント A に 1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "-1"

[Killed] BlockStatement
syuji-higa/demo-react-counter/src/App.tsx:23:27
   }
   
   // デクリメントの関数
-  const decrement = () => {
-    setCount(count - 1)
-  }
+  const decrement = () => {}
   
   return { count, increment, decrement }
killedBy: カウンター A は - ボタンを 1 回クリックすると カウント A に -1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-1"
Received: "0"

[Killed] ArithmeticOperator
syuji-higa/demo-react-counter/src/App.tsx:24:14
   
   // デクリメントの関数
   const decrement = () => {
-    setCount(count - 1)
+    setCount(count + 1)
   }
   
killedBy: カウンター A は - ボタンを 1 回クリックすると カウント A に -1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-1"
Received: "1"

[Killed] ArithmeticOperator
syuji-higa/demo-react-counter/src/App.tsx:47:22
   } = useCount(0)  // 初期値を入れる
   
   // 両方を合計した値
-  const totalCount = countA + countB
+  const totalCount = countA - countB
   
   // 両方をインクリメントするイベントハンドラ
killedBy: 合計カウンターは + ボタンを 1 回クリックすると 合計カウントに 2 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "0"

[Killed] BlockStatement
syuji-higa/demo-react-counter/src/App.tsx:50:30
   const totalCount = countA + countB
   
   // 両方をインクリメントするイベントハンドラ
-  const incrementAll = () => {
-    incrementA()
-    incrementB()
-  }
+  const incrementAll = () => {}
   
   // 両方をデクリメントするイベントハンドラ
killedBy: 合計カウンターは + ボタンを 1 回クリックすると カウント A に 1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "0"

[Killed] BlockStatement
syuji-higa/demo-react-counter/src/App.tsx:56:30
   }
   
   // 両方をデクリメントするイベントハンドラ
-  const decrementAll = () => {
-    decrementA()
-    decrementB()
-  }
+  const decrementAll = () => {}
   
   return (
killedBy: 合計カウンターは - ボタンを 1 回クリックすると カウント A に 1 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-1"
Received: "0"
