[Killed] BlockStatement
demo-react-counter/src/components/Count.tsx:9:78
 }
 
 // 各カウントのコンポーネント
-export const Count: VFC<Props> = ({ label, count, increment, decrement }) => {
-  // 100 までのカウントダウンの値
-  const remaining = 100 - count
-  
-  return (
-  	<div>
-      <div
-        aria-label={`Counter ${label} count`}
-      >{label}：{count}（100 まであと {remaining}）</div>
-      <button
-        aria-label={`Counter ${label} decrement`}
-        type="button"
-        onClick={decrement}
-      >-</button>
-      <button
-        aria-label={`Counter ${label} increment`}
-        type="button"
-        onClick={increment}
-      >+</button>
-  	</div>
-  )
-}
+export const Count: VFC<Props> = ({ label, count, increment, decrement }) => {}
 
killedBy: カウンター A は はじめに カウント A の Aria Label に "Counter A count" を設定する
statusReason: Error: Count(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArithmeticOperator
demo-react-counter/src/components/Count.tsx:11:21
 // 各カウントのコンポーネント
 export const Count: VFC<Props> = ({ label, count, increment, decrement }) => {
   // 100 までのカウントダウンの値
-  const remaining = 100 - count
+  const remaining = 100 + count
   
   return (
killedBy: カウンター A は + ボタンを 1 回クリックすると カウント A の 100 までの残りに 99 を表示する
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "99"
Received: "101"

[Killed] StringLiteral
demo-react-counter/src/components/Count.tsx:19:21
         aria-label={`Counter ${label} count`}
       >{label}：{count}（100 まであと {remaining}）</div>
       <button
-        aria-label={`Counter ${label} decrement`}
+        aria-label={``}
         type="button"
         onClick={decrement}
killedBy: カウンター A は はじめに カウント A の Aria Label に "Counter A count" を設定する
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Counter A decrement"

Here are the accessible roles:

  button:

  Name "-":
  <button

[Killed] StringLiteral
demo-react-counter/src/components/Count.tsx:24:21
         onClick={decrement}
       >-</button>
       <button
-        aria-label={`Counter ${label} increment`}
+        aria-label={``}
         type="button"
         onClick={increment}
killedBy: カウンター A は はじめに カウント A の Aria Label に "Counter A count" を設定する
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Counter A increment"

Here are the accessible roles:

  button:

  Name "Counter A decrement":
  <button
