[Killed] BlockStatement
demo-react-counter/src/components/TotalCount.tsx:10:81
 }
 
 // 合計カウントのコンポーネント
-export const TotalCount: VFC<Props> = ({ totalCount, increment, decrement }) => {
-  return (
-  	<div>
-      <div
-        aria-label="Total Counter count"
-      >合計：{totalCount}</div>
-      <span>両方を増減</span>
-      <button
-        aria-label={`Total Counter decrement`}
-        type="button"
-        onClick={decrement}
-      >-</button>
-      <button
-        aria-label={`Total Counter increment`}
-        type="button"
-        onClick={increment}
-      >+</button>
-    </div>
-  )
-}
+export const TotalCount: VFC<Props> = ({ totalCount, increment, decrement }) => {}
 
killedBy: カウンター A は はじめに カウント A の Aria Label に "Counter A count" を設定する
statusReason: Error: TotalCount(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
demo-react-counter/src/components/TotalCount.tsx:18:21
       >合計：{totalCount}</div>
       <span>両方を増減</span>
       <button
-        aria-label={`Total Counter decrement`}
+        aria-label={``}
         type="button"
         onClick={decrement}
killedBy: 合計カウンターは はじめに 合計カウントに 0 を表示する
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Total Counter decrement"

Here are the accessible roles:

  button:

  Name "Counter A decrement":
  <button

[Killed] StringLiteral
demo-react-counter/src/components/TotalCount.tsx:23:21
         onClick={decrement}
       >-</button>
       <button
-        aria-label={`Total Counter increment`}
+        aria-label={``}
         type="button"
         onClick={increment}
killedBy: 合計カウンターは はじめに 合計カウントに 0 を表示する
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Total Counter increment"

Here are the accessible roles:

  button:

  Name "Counter A decrement":
  <button
